---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsValidForSurfaceTolerance(System.Double)
source: html/97afa54a-57c4-f59d-019d-21f34bf67412.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsValidForSurfaceTolerance Method

Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForSurfaceTolerance(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for SurfaceTolerance, false otherwise.